/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                       SylixOS(TM)
**
**                               Copyright  All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: cskyCache.h
**
** 创   建   人: Wang.Xuan (王翾)
**
** 文件创建日期: 2018 年 05 月 14 日
**
** 描        述: C-SKY 体系构架 CACHE 驱动.
*********************************************************************************************************/

#ifndef __ARCH_CSKYCACHE_H
#define __ARCH_CSKYCACHE_H

VOID  cskyCacheInit(LW_CACHE_OP *pcacheop,
                    CACHE_MODE   uiInstruction,
                    CACHE_MODE   uiData,
                    CPCHAR       pcMachineName);
VOID  cskyCacheReset(CPCHAR  pcMachineName);

#endif                                                                  /*  __ARCH_CSKYCACHE_H          */
/*********************************************************************************************************
  END
*********************************************************************************************************/
