/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                       SylixOS(TM)
**
**                               Copyright  All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: arm64VfpNone.h
**
** 创   建   人: Wang.Xuan (王翾)
**
** 文件创建日期: 2018 年 06 月 29 日
**
** 描        述: ARM 体系架构无 VFP 支持.
*********************************************************************************************************/

#ifndef __ARM64VFPNONE_H
#define __ARM64VFPNONE_H

PARM64_FPU_OP  arm64VfpNonePrimaryInit(CPCHAR  pcMachineName, CPCHAR  pcFpuName);
VOID           arm64VfpNoneSecondaryInit(CPCHAR  pcMachineName, CPCHAR  pcFpuName);

#endif                                                                  /*  __ARM64VFPNONE_H            */
/*********************************************************************************************************
  END
*********************************************************************************************************/
