/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                       SylixOS(TM)
**
**                               Copyright  All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: arm64VfpNone.c
**
** 创   建   人: Wang.Xuan (王翾)
**
** 文件创建日期: 2018 年 06 月 29 日
**
** 描        述: ARM64 体系架构无 VFP 支持.
*********************************************************************************************************/
#define  __SYLIXOS_STDIO
#define  __SYLIXOS_KERNEL
#include "SylixOS.h"
/*********************************************************************************************************
  裁剪支持
*********************************************************************************************************/
#if LW_CFG_CPU_FPU_EN > 0
#include "../arm64Fpu.h"
/*********************************************************************************************************
  全局变量
*********************************************************************************************************/
static ARM64_FPU_OP     _G_fpuopVfpNone;
/*********************************************************************************************************
** 函数名称: arm64VfpNoneSid
** 功能描述: 获得 VFP SID
** 输　入  : NONE
** 输　出  : SID
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
static ULONG arm64VfpNoneSid (VOID)
{
    return  (0ul);
}
/*********************************************************************************************************
** 函数名称: arm64VfpNoneEnable
** 功能描述: 使能 VFP
** 输　入  : NONE
** 输　出  : NONE
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
static VOID  arm64VfpNoneEnable (VOID)
{
}
/*********************************************************************************************************
** 函数名称: arm64VfpNoneDisable
** 功能描述: 禁能 VFP
** 输　入  : NONE
** 输　出  : NONE
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
static VOID  arm64VfpNoneDisable (VOID)
{
}
/*********************************************************************************************************
** 函数名称: arm64VfpNoneIsEnable
** 功能描述: 是否使能了 VFP
** 输　入  : NONE
** 输　出  : 是否使能
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
static BOOL  arm64VfpNoneIsEnable (VOID)
{
    return  (LW_TRUE);
}
/*********************************************************************************************************
** 函数名称: arm64VfpNoneSave
** 功能描述: 保存 VFP 上下文
** 输　入  : pvFpuCtx  VFP 上下文
** 输　出  : NONE
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
static VOID  arm64VfpNoneSave (PVOID  pvFpuCtx)
{
}
/*********************************************************************************************************
** 函数名称: arm64VfpNoneRestore
** 功能描述: 恢复 VFP 上下文
** 输　入  : pvFpuCtx  VFP 上下文
** 输　出  : NONE
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
static VOID  arm64VfpNoneRestore (PVOID  pvFpuCtx)
{
}
/*********************************************************************************************************
** 函数名称: arm64VfpNoneCtxShow
** 功能描述: 显示 VFP 上下文
** 输　入  : iFd       输出文件描述符
**           pvFpuCtx  VFP 上下文
** 输　出  : NONE
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
static VOID  arm64VfpNoneCtxShow (INT  iFd, PVOID  pvFpuCtx)
{
#if (LW_CFG_DEVICE_EN > 0) && (LW_CFG_FIO_LIB_EN > 0)
    fdprintf(iFd, "no vfp\n");
#endif
}
/*********************************************************************************************************
** 函数名称: arm64VfpNonePrimaryInit
** 功能描述: 获取 VFP 控制器操作函数集
** 输　入  : pcMachineName 机器名
**           pcFpuName     浮点运算器名
** 输　出  : 操作函数集
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
PARM64_FPU_OP  arm64VfpNonePrimaryInit (CPCHAR  pcMachineName, CPCHAR  pcFpuName)
{
    _G_fpuopVfpNone.AFPU_pfuncHwSid    = arm64VfpNoneSid;
    _G_fpuopVfpNone.AFPU_pfuncEnable   = arm64VfpNoneEnable;
    _G_fpuopVfpNone.AFPU_pfuncDisable  = arm64VfpNoneDisable;
    _G_fpuopVfpNone.AFPU_pfuncIsEnable = arm64VfpNoneIsEnable;
    _G_fpuopVfpNone.AFPU_pfuncSave     = arm64VfpNoneSave;
    _G_fpuopVfpNone.AFPU_pfuncRestore  = arm64VfpNoneRestore;
    _G_fpuopVfpNone.AFPU_pfuncCtxShow  = arm64VfpNoneCtxShow;

    return  (&_G_fpuopVfpNone);
}
/*********************************************************************************************************
** 函数名称: arm64VfpNoneSecondaryInit
** 功能描述: 初始化 VFP 控制器
** 输　入  : pcMachineName 机器名
**           pcFpuName     浮点运算器名
** 输　出  : NONE
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
VOID  arm64VfpNoneSecondaryInit (CPCHAR  pcMachineName, CPCHAR  pcFpuName)
{
    (VOID)pcMachineName;
    (VOID)pcFpuName;
}

#endif                                                                  /*  LW_CFG_CPU_FPU_EN > 0       */
/*********************************************************************************************************
  END
*********************************************************************************************************/
