/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: arch_regs.h
**
** 创   建   人: Wang.Xuan (王翾)
**
** 文件创建日期: 2018 年 11 月 12 日
**
** 描        述: CK803 体系架构寄存器相关.
*********************************************************************************************************/

#ifndef __CSKYCK803_ARCH_REGS_H
#define __CSKYCK803_ARCH_REGS_H

/*********************************************************************************************************
  定义
*********************************************************************************************************/

#define ARCH_GREG_NR            17                                      /*  通用寄存器数目              */

#define ARCH_REG_CTX_WORD_SIZE  20                                      /*  寄存器上下文字数            */
#define ARCH_STK_MIN_WORD_SIZE  256                                     /*  堆栈最小字数                */

#define ARCH_REG_SIZE           4                                       /*  寄存器大小                  */
#define ARCH_REG_CTX_SIZE       (ARCH_REG_CTX_WORD_SIZE * ARCH_REG_SIZE)/*  寄存器上下文大小            */

#define ARCH_STK_ALIGN_SIZE     8                                       /*  堆栈对齐要求                */

#define ARCH_JMP_BUF_WORD_SIZE  20                                      /*  跳转缓冲字数(向后兼容)      */

/*********************************************************************************************************
  寄存器在 ARCH_REG_CTX 中的偏移量
*********************************************************************************************************/

#define XGREG(n)                ((n)  * ARCH_REG_SIZE)
#define XGREG28                 ((16) * ARCH_REG_SIZE)
#define XPC                     ((ARCH_GREG_NR + 0) * ARCH_REG_SIZE)
#define XPSR                    ((ARCH_GREG_NR + 1) * ARCH_REG_SIZE)

/*********************************************************************************************************
  寄存器表
*********************************************************************************************************/

#if (!defined(__ASSEMBLY__)) && (!defined(ASSEMBLY))

typedef UINT32      ARCH_REG_T;

typedef struct {
    ARCH_REG_T  REG_ulReg[ARCH_GREG_NR];                                /*  17 个通用目的寄存器         */
    ARCH_REG_T  REG_ulPc;                                               /*  程序计数器寄存器            */
    ARCH_REG_T  REG_ulPsr;                                              /*  处理器状态寄存器            */
    ARCH_REG_T  REG_ulPad;

#define REG_A0                  0                                       /*  第一个参数                  */
#define REG_A1                  1                                       /*  第二个参数                  */
#define REG_A2                  2                                       /*  第三个参数                  */
#define REG_A3                  3                                       /*  第四个参数                  */
#define REG_SP                  14                                      /*  堆栈指针                    */
#define REG_FP                  8                                       /*  FP                          */
#define REG_RA                  15                                      /*  链接寄存器                  */
} ARCH_REG_CTX;

/*********************************************************************************************************
  调用回溯堆栈表
*********************************************************************************************************/

typedef struct {
    ARCH_REG_T      FP_uiFp;
    ARCH_REG_T      FP_uiLr;
} ARCH_FP_CTX;

/*********************************************************************************************************
  从上下文中获取信息
*********************************************************************************************************/

#define ARCH_REG_CTX_GET_PC(ctx)    ((void *)(ctx).REG_ulPc)

#endif                                                                  /*  !defined(__ASSEMBLY__)      */
#endif                                                                  /*  __CSKYCK803_ARCH_REGS_H     */
/*********************************************************************************************************
  END
*********************************************************************************************************/
