/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                       SylixOS(TM)
**
**                               Copyright  All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: arm64VfpV4El2.h
**
** 创   建   人: Wang.Xuan (王翾)
**
** 文件创建日期: 2018 年 10 月 27 日
**
** 描        述: ARM64 体系架构 VFPv4 支持 (在 EL2 中处理).
*********************************************************************************************************/

#ifndef __ARM64VFPV4EL2_H
#define __ARM64VFPV4EL2_H

PARM64_FPU_OP  arm64VfpV4El2PrimaryInit(CPCHAR  pcMachineName, CPCHAR  pcFpuName);
VOID           arm64VfpV4El2SecondaryInit(CPCHAR  pcMachineName, CPCHAR  pcFpuName);

#endif                                                                  /*  __ARMV64FPV4EL2_H           */
/*********************************************************************************************************
  END
*********************************************************************************************************/
