/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: sparcUnaligned.h
**
** 创   建   人: Jiao.JinXing (焦进星)
**
** 文件创建日期: 2018 年 11 月 16 日
**
** 描        述: SPARC 体系构架非对齐异常处理.
*********************************************************************************************************/

#ifndef __ARCH_SPARCUNALIGNED_H
#define __ARCH_SPARCUNALIGNED_H

VOID  sparcUnalignedHandle(ARCH_REG_CTX  *pregctx, addr_t  *pulAbortAddr, PLW_VMM_ABORT  pabtInfo);

#endif                                                                  /*  __ARCH_SPARCUNALIGNED_H     */
/*********************************************************************************************************
  END
*********************************************************************************************************/
