/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                       SylixOS(TM)
**
**                               Copyright  All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: cskyMpu.h
**
** 创   建   人: Wang.Xuan (王翾)
**
** 文件创建日期: 2018 年 11 月 12 日
**
** 描        述: C-SKY 体系架构 MPU 驱动.
*********************************************************************************************************/

#ifndef __CSKYMPU_H
#define __CSKYMPU_H

VOID  cskyMpuInit(CPCHAR  pcMachineName, const CSKY_MPU_REGION  mpuregion[]);
PVOID cskyMpuDmaAlloc(size_t  stSize);
PVOID cskyMpuDmaAllocAlign(size_t  stSize, size_t  stAlign);
VOID  cskyMpuDmaFree(PVOID  pvDmaMem);

#endif                                                                  /*  __CSKYMPU_H                 */
/*********************************************************************************************************
  END
*********************************************************************************************************/
