/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                       SylixOS(TM)
**
**                               Copyright  All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: cskyVfpNone.h
**
** 创   建   人: Wang.Xuan (王翾)
**
** 文件创建日期: 2018 年 05 月 14 日
**
** 描        述: C-SKY 体系架构无 VFP 支持.
*********************************************************************************************************/

#ifndef __ARCH_CSKYVFPNONE_H
#define __ARCH_CSKYVFPNONE_H

PCSKY_FPU_OP  cskyVfpNonePrimaryInit(CPCHAR    pcMachineName, CPCHAR  pcFpuName);
VOID          cskyVfpNoneSecondaryInit(CPCHAR  pcMachineName, CPCHAR  pcFpuName);

#endif                                                                  /*  __ARCH_CSKYVFPNONE_H        */
/*********************************************************************************************************
  END
*********************************************************************************************************/
